app/controllers/invoices_controller.rb

  def index
    @invoices = Invoice.includes(:client, :line_items)
                       .order(created_at: :desc)

    # Apply status filter if provided
    if params[:status].present? && params[:status] != 'all'
      @invoices = @invoices.where(status: params[:status])
    end

    render inertia: 'Invoices/Index', props: {
      invoices: @invoices.map { |invoice| serialize_invoice(invoice) },
      filters: {
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" IN (4, 6, 5)
SELECT "invoices".* FROM "invoices" ORDER BY "invoices"."created_at" DESC
SELECT "line_items".* FROM "line_items" WHERE "line_items"."invoice_id" IN (8, 7, 6, 5)